rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_EIM_2.h
/*! @name EICHD5_WORD1 - Error Injection Channel Descriptor 5, Word1 */
/*! @{ */

#define EIM_2_EICHD5_WORD1_B0_3DATA_MASK_MASK    (0xFFFFFFFU)
#define EIM_2_EICHD5_WORD1_B0_3DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD5_WORD1_B0_3DATA_MASK_WIDTH   (28U)
#define EIM_2_EICHD5_WORD1_B0_3DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD5_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD5_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD5_WORD2 - Error Injection Channel Descriptor 5, Word2 */
/*! @{ */

#define EIM_2_EICHD5_WORD2_B4_7DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_2_EICHD5_WORD2_B4_7DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD5_WORD2_B4_7DATA_MASK_WIDTH   (32U)
#define EIM_2_EICHD5_WORD2_B4_7DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD5_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD5_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD5_WORD3 - Error Injection Channel Descriptor 5, Word3 */
/*! @{ */

#define EIM_2_EICHD5_WORD3_B8_11DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_2_EICHD5_WORD3_B8_11DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD5_WORD3_B8_11DATA_MASK_WIDTH  (32U)
#define EIM_2_EICHD5_WORD3_B8_11DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD5_WORD3_B8_11DATA_MASK_SHIFT)) & EIM_2_EICHD5_WORD3_B8_11DATA_MASK_MASK)
/*! @} */

/*! @name EICHD5_WORD4 - Error Injection Channel Descriptor 5, Word4 */
/*! @{ */

#define EIM_2_EICHD5_WORD4_B12_15DATA_MASK_MASK  (0xFFFFFFFFU)
#define EIM_2_EICHD5_WORD4_B12_15DATA_MASK_SHIFT (0U)
#define EIM_2_EICHD5_WORD4_B12_15DATA_MASK_WIDTH (32U)
#define EIM_2_EICHD5_WORD4_B12_15DATA_MASK(x)    (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD5_WORD4_B12_15DATA_MASK_SHIFT)) & EIM_2_EICHD5_WORD4_B12_15DATA_MASK_MASK)
/*! @} */

/*! @name EICHD5_WORD5 - Error Injection Channel Descriptor 5, Word5 */
/*! @{ */

#define EIM_2_EICHD5_WORD5_B16_19DATA_MASK_MASK  (0xFFFFFFFFU)
#define EIM_2_EICHD5_WORD5_B16_19DATA_MASK_SHIFT (0U)
#define EIM_2_EICHD5_WORD5_B16_19DATA_MASK_WIDTH (32U)
#define EIM_2_EICHD5_WORD5_B16_19DATA_MASK(x)    (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD5_WORD5_B16_19DATA_MASK_SHIFT)) & EIM_2_EICHD5_WORD5_B16_19DATA_MASK_MASK)
/*! @} */

/*! @name EICHD5_WORD6 - Error Injection Channel Descriptor 5, Word6 */
/*! @{ */

#define EIM_2_EICHD5_WORD6_B20_23DATA_MASK_MASK  (0xFFFFFFFFU)
#define EIM_2_EICHD5_WORD6_B20_23DATA_MASK_SHIFT (0U)
#define EIM_2_EICHD5_WORD6_B20_23DATA_MASK_WIDTH (32U)
#define EIM_2_EICHD5_WORD6_B20_23DATA_MASK(x)    (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD5_WORD6_B20_23DATA_MASK_SHIFT)) & EIM_2_EICHD5_WORD6_B20_23DATA_MASK_MASK)
/*! @} */

/*! @name EICHD6_WORD1 - Error Injection Channel Descriptor 6, Word1 */
/*! @{ */

#define EIM_2_EICHD6_WORD1_B0_3DATA_MASK_MASK    (0xFFFFFFFU)
#define EIM_2_EICHD6_WORD1_B0_3DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD6_WORD1_B0_3DATA_MASK_WIDTH   (28U)
#define EIM_2_EICHD6_WORD1_B0_3DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD6_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD6_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD6_WORD2 - Error Injection Channel Descriptor 6, Word2 */
/*! @{ */

#define EIM_2_EICHD6_WORD2_B4_7DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_2_EICHD6_WORD2_B4_7DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD6_WORD2_B4_7DATA_MASK_WIDTH   (32U)
#define EIM_2_EICHD6_WORD2_B4_7DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD6_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD6_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

/*! @name EICHD6_WORD3 - Error Injection Channel Descriptor 6, Word3 */
/*! @{ */

#define EIM_2_EICHD6_WORD3_B8_11DATA_MASK_MASK   (0xFFFFFFFFU)
#define EIM_2_EICHD6_WORD3_B8_11DATA_MASK_SHIFT  (0U)
#define EIM_2_EICHD6_WORD3_B8_11DATA_MASK_WIDTH  (32U)
#define EIM_2_EICHD6_WORD3_B8_11DATA_MASK(x)     (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD6_WORD3_B8_11DATA_MASK_SHIFT)) & EIM_2_EICHD6_WORD3_B8_11DATA_MASK_MASK)
/*! @} */

/*! @name EICHD6_WORD4 - Error Injection Channel Descriptor 6, Word4 */
/*! @{ */

#define EIM_2_EICHD6_WORD4_B12_15DATA_MASK_MASK  (0xFFFFFFFFU)
#define EIM_2_EICHD6_WORD4_B12_15DATA_MASK_SHIFT (0U)
#define EIM_2_EICHD6_WORD4_B12_15DATA_MASK_WIDTH (32U)
#define EIM_2_EICHD6_WORD4_B12_15DATA_MASK(x)    (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD6_WORD4_B12_15DATA_MASK_SHIFT)) & EIM_2_EICHD6_WORD4_B12_15DATA_MASK_MASK)
/*! @} */

/*! @name EICHD6_WORD5 - Error Injection Channel Descriptor 6, Word5 */
/*! @{ */

#define EIM_2_EICHD6_WORD5_B16_19DATA_MASK_MASK  (0xFFFFFFFFU)
#define EIM_2_EICHD6_WORD5_B16_19DATA_MASK_SHIFT (0U)
#define EIM_2_EICHD6_WORD5_B16_19DATA_MASK_WIDTH (32U)
#define EIM_2_EICHD6_WORD5_B16_19DATA_MASK(x)    (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD6_WORD5_B16_19DATA_MASK_SHIFT)) & EIM_2_EICHD6_WORD5_B16_19DATA_MASK_MASK)
/*! @} */

/*! @name EICHD6_WORD6 - Error Injection Channel Descriptor 6, Word6 */
/*! @{ */

#define EIM_2_EICHD6_WORD6_B20_23DATA_MASK_MASK  (0xFFFFFFFFU)
#define EIM_2_EICHD6_WORD6_B20_23DATA_MASK_SHIFT (0U)
#define EIM_2_EICHD6_WORD6_B20_23DATA_MASK_WIDTH (32U)
#define EIM_2_EICHD6_WORD6_B20_23DATA_MASK(x)    (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD6_WORD6_B20_23DATA_MASK_SHIFT)) & EIM_2_EICHD6_WORD6_B20_23DATA_MASK_MASK)
/*! @} */

/*! @name EICHD7_WORD1 - Error Injection Channel Descriptor 7, Word1 */
/*! @{ */

#define EIM_2_EICHD7_WORD1_B0_3DATA_MASK_MASK    (0xFFFFFFFU)
#define EIM_2_EICHD7_WORD1_B0_3DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD7_WORD1_B0_3DATA_MASK_WIDTH   (28U)
#define EIM_2_EICHD7_WORD1_B0_3DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD7_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_2_EICHD7_WORD1_B0_3DATA_MASK_MASK)
/*! @} */

/*! @name EICHD7_WORD2 - Error Injection Channel Descriptor 7, Word2 */
/*! @{ */

#define EIM_2_EICHD7_WORD2_B4_7DATA_MASK_MASK    (0xFFFFFFFFU)
#define EIM_2_EICHD7_WORD2_B4_7DATA_MASK_SHIFT   (0U)
#define EIM_2_EICHD7_WORD2_B4_7DATA_MASK_WIDTH   (32U)
#define EIM_2_EICHD7_WORD2_B4_7DATA_MASK(x)      (((uint32_t)(((uint32_t)(x)) << EIM_2_EICHD7_WORD2_B4_7DATA_MASK_SHIFT)) & EIM_2_EICHD7_WORD2_B4_7DATA_MASK_MASK)
/*! @} */

